Documents/ИА_ПланПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ПланПродаж</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланУтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныйПлан</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Неделя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ИсточникиОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Неделя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ИсточникиОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИА_РаспределениеНедель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_РаспределениеНедель</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецНедели</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПереходнаяНеделя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИА_ПланПродаж/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ЕстьПравоУтверждения = ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.УтверждениеПланаПродаж);
	
	Если Объект.Ссылка.Пустая() тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата = ТекущаяДата();
		Если ФППоОрганизациям ТОгда
			Объект.Организация = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ОсновнаяОрганизация);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ЗаполнитьИсходныйПлан();	
	ЗаполнитьПлан();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлан()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ПланПродажПлан.Неделя КАК Неделя,
	               |	ИА_ПланПродажПлан.Контрагент,
	               |	ИА_ПланПродажПлан.Продукт,
	               |	ИА_ПланПродажПлан.Сумма,
	               |	ИА_ПланПродажПлан.Действия,
	               |	ИА_ПланПродажПлан.Источник,
	               |	ИА_ПланПродажПлан.Факт,
	               |	ИА_ПланПродажПлан.КонецНедели
	               |ИЗ
	               |	Документ.ИА_ПланПродаж.План КАК ИА_ПланПродажПлан
	               |ГДЕ
	               |	ИА_ПланПродажПлан.Ссылка = &Ссылка
	               |ИТОГИ МАКСИМУМ(ИА_ПланПродажПлан.КонецНедели) ПО
	               |	Неделя";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Дер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для каждого стрНеделя из Дер.Строки Цикл
		НовСтрНед = ДеревоПлан.ПолучитьЭлементы().Добавить();
		НовСтрНед.Неделя = стрНеделя.неделя;
		НовСтрНед.КонецНедели = стрНеделя.КонецНедели;
		НовСтрНед.НеделяПредставление = ПолучитьПредставлениеНедели(стрНеделя.неделя, стрНеделя.КонецНедели);
		НовСтрНед.ЭтоНеделя = Истина;
		
		для каждого стрПлан из стрНеделя.Строки Цикл
			Если не ЗначениеЗаполнено(стрПлан.Сумма) и не ЗначениеЗаполнено(стрПлан.Факт) Тогда
				Продолжить;
			КонецЕсли;
			
			новСтрПлан = НовСтрНед.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(новСтрПлан, стрПлан);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсходныйПлан()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ПланПродажПлан.Неделя КАК Неделя,
	               |	ИА_ПланПродажПлан.Контрагент,
	               |	ИА_ПланПродажПлан.Продукт,
	               |	ИА_ПланПродажПлан.Сумма,
	               |	ИА_ПланПродажПлан.Действия,
	               |	ИА_ПланПродажПлан.Источник,
	               |	ИА_ПланПродажПлан.КонецНедели
	               |ИЗ
	               |	Документ.ИА_ПланПродаж.ИсходныйПлан КАК ИА_ПланПродажПлан
	               |ГДЕ
	               |	ИА_ПланПродажПлан.Ссылка = &Ссылка
	               |ИТОГИ МАКСИМУМ(ИА_ПланПродажПлан.КонецНедели) ПО
	               |	Неделя";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Дер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для каждого стрНеделя из Дер.Строки Цикл
		НовСтрНед = ДеревоПланИсходный.ПолучитьЭлементы().Добавить();
		НовСтрНед.Неделя = стрНеделя.неделя;
		НовСтрНед.КонецНедели = стрНеделя.КонецНедели;
		НовСтрНед.НеделяПредставление = ПолучитьПредставлениеНедели(стрНеделя.неделя, стрНеделя.КонецНедели);
		НовСтрНед.ЭтоНеделя = Истина;
		
		для каждого стрПлан из стрНеделя.Строки Цикл
			Если не ЗначениеЗаполнено(стрПлан.Сумма) Тогда
				Продолжить;
			КонецЕсли;
			
			новСтрПлан = НовСтрНед.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(новСтрПлан, стрПлан);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НаМесяцПриИзменении(Элемент)
	Объект.НаМесяц = НачалоМесяца(Объект.НаМесяц);
	ЗаполнитьНедели();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНедели()
	
	Источник = ?(Объект.ПланУтвержден, ДеревоПлан, ДеревоПланИсходный);
	
	Строки = Источник.ПолучитьЭлементы();
	Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_РаспределениеНедель.Период КАК Период,
	               |	ИА_РаспределениеНедель.КонецНедели
	               |ИЗ
	               |	РегистрСведений.ИА_РаспределениеНедель КАК ИА_РаспределениеНедель
	               |ГДЕ
	               |	ИА_РаспределениеНедель.Месяц = &Месяц
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.УстановитьПараметр("Месяц", Объект.НаМесяц);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Сообщить("Заполните распределение недель!");
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		новстр = Строки.Добавить();
		новстр.неделя = Выборка.Период;
		новстр.КонецНедели = Выборка.КонецНедели;
		новстр.НеделяПредставление = ПолучитьПредставлениеНедели(новстр.неделя, новстр.КонецНедели);
		новстр.ЭтоНеделя = истина; 		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	тд = Элементы.ДеревоПланИсходный.ТекущиеДанные;
	тс = Элементы.ДеревоПланИсходный.ТекущаяСтрока;
	Если тд<>Неопределено Тогда		
		Если тд.ЭтоНеделя Тогда
			новстр = тд.ПолучитьЭлементы().Добавить();
			Если не Элементы.ДеревоПланИсходный.Развернут(тс) Тогда
				Элементы.ДеревоПланИсходный.Развернуть(тс);
			КонецЕсли;
		Иначе
			новстр = тд.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
		КонецЕсли;
		Элементы.ДеревоПланИсходный.ТекущаяСтрока = новстр.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуКорр(Команда)
	тд = Элементы.ДеревоПлан.ТекущиеДанные;
	тс = Элементы.ДеревоПлан.ТекущаяСтрока;
	Если тд<>Неопределено Тогда		
		Если тд.ЭтоНеделя Тогда
			новстр = тд.ПолучитьЭлементы().Добавить();
			новстр.Неделя = тд.неделя;
			новстр.КонецНедели = тд.КонецНедели;
			Если не Элементы.ДеревоПлан.Развернут(тс) Тогда
				Элементы.ДеревоПлан.Развернуть(тс);
			КонецЕсли;
		Иначе
			новстр = тд.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
			новстр.Неделя = тд.ПолучитьРодителя().неделя;
			новстр.КонецНедели = тд.ПолучитьРодителя().КонецНедели;
		КонецЕсли;
		Элементы.ДеревоПлан.ТекущаяСтрока = новстр.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ИсходныйПлан.Очистить();
	
	Для каждого стрНеделя из ДеревоПланИсходный.ПолучитьЭлементы() Цикл
		текНеделя = стрНеделя.Неделя;
		текКонецНедели = стрНеделя.КонецНедели;
		Для каждого стрПлан из стрНеделя.ПолучитьЭлементы() Цикл
			Новстр = ТекущийОбъект.ИсходныйПлан.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стрПлан);
			Новстр.неделя = текНеделя; 
			Новстр.КонецНедели = текКонецНедели; 
		КонецЦикла;
		
		Если стрНеделя.ПолучитьЭлементы().Количество() = 0 Тогда
			Новстр = ТекущийОбъект.ИсходныйПлан.Добавить();
			Новстр.неделя = текНеделя; 
			Новстр.КонецНедели = текКонецНедели; 
		КонецЕсли;
	КонецЦикла;
	
	//
	ТекущийОбъект.План.Очистить();
	Для каждого стрНеделя из ДеревоПлан.ПолучитьЭлементы() Цикл
		текНеделя = стрНеделя.Неделя;
		текКонецНедели = стрНеделя.КонецНедели;
		Для каждого стрПлан из стрНеделя.ПолучитьЭлементы() Цикл
			Новстр = ТекущийОбъект.План.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стрПлан);
			Новстр.неделя = текНеделя; 
			Новстр.КонецНедели = текКонецНедели; 
		КонецЦикла;
		
		Если стрНеделя.ПолучитьЭлементы().Количество() = 0 Тогда
			Новстр = ТекущийОбъект.План.Добавить();
			Новстр.неделя = текНеделя; 
			Новстр.КонецНедели = текКонецНедели; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура обновитьИтого()
	ИтогоИсходныйПлан = 0;
	Для каждого стрНед из ДеревоПланИсходный.ПолучитьЭлементы() Цикл
		СуммаИтого = 0;
		Для каждого стрПлан из стрНед.ПолучитьЭлементы() Цикл
			СуммаИтого = СуммаИтого + стрПлан.Сумма;
		КонецЦикла;
		стрНед.Сумма = СуммаИтого;
		ИтогоИсходныйПлан = ИтогоИсходныйПлан + СуммаИтого;
	КонецЦикла;
	
	ИтогоПлан = 0;
	ИтогоФакт = 0;
	ИтогоОтклонение = 0;
	Для каждого стрНед из ДеревоПлан.ПолучитьЭлементы() Цикл
		СуммаИтого = 0;
		СуммаИтогоФакт = 0;
		СуммаИтогоОтклонение = 0;
		Для каждого стрПлан из стрНед.ПолучитьЭлементы() Цикл
			СуммаИтого = СуммаИтого + стрПлан.Сумма;
			СуммаИтогоФакт =  СуммаИтогоФакт + стрПлан.Факт;
			СуммаИтогоОтклонение =  СуммаИтогоОтклонение + стрПлан.Отклонение;
		КонецЦикла;
		стрНед.Сумма = СуммаИтого;
		ИтогоПлан = ИтогоПлан + СуммаИтого;
		
		стрНед.Факт = СуммаИтогоФакт;
		ИтогоФакт = ИтогоФакт + СуммаИтогоФакт;
		
		стрНед.Отклонение = СуммаИтогоОтклонение;
		ИтогоОтклонение = ИтогоОтклонение + СуммаИтогоОтклонение;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если не ИА_Защита_Общий.ЛицензияДоступна("ФП") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	ЗаполнитьВозможныеМесяцы();
	ПредставлениеМесяца = ПолучитьПредставлениеМесяца(Объект.НаМесяц);
	
	ОбновитьДоступностьЭлементов();
	
	ПересчитатьОтклонениеСуммуВСтроках();
	обновитьИтого();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВозможныеМесяцы()
	Элементы.ПредставлениеМесяца.СписокВыбора.Очистить();
	ТекМесяц = НачалоМесяца(Объект.Дата);
	Для сч = 1 по 5 цикл
		Элементы.ПредставлениеМесяца.СписокВыбора.Добавить(формат(ТекМесяц, "ДФ=ггггММдд"), ПолучитьПредставлениеМесяца(ТекМесяц));
		ТекМесяц = ДобавитьМесяц(ТекМесяц, 1);
	КонецЦикла;
КонецПроцедуры
	
	
&НаКлиенте
Процедура ОбновитьДоступностьЭлементов()
	Элементы.Организация.Видимость = ФППоОрганизациям;
	Элементы.Организация.АвтоОтметкаНезаполненного = ФППоОрганизациям;
	
	Элементы.ГруппаИсходныйПлан.ТолькоПросмотр = Объект.ПланУтвержден;
	Элементы.ДеревоПланИсходный.КоманднаяПанель.Доступность = не Объект.ПланУтвержден;
	Элементы.ГруппаПлан.Видимость = Объект.ПланУтвержден;
	
	Элементы.ПредставлениеМесяца.ТолькоПросмотр = Объект.ПланУтвержден;
	
	Элементы.ФормаУтвердитьПлан.Доступность = ЕстьПравоУтверждения и не Объект.ПланУтвержден;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланСуммаПриИзменении(Элемент)
	обновитьИтого();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланПослеУдаления(Элемент)
	обновитьИтого();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланПередУдалением(Элемент, Отказ)
	Если Элементы.ДеревоПланИсходный.ТекущиеДанные <> Неопределено И Элементы.ДеревоПланИсходный.ТекущиеДанные.ЭтоНеделя Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПланПродажПоКонтрагентам(Команда)
	
	Если Модифицированность И Не ПерезаписатьДокумент() Тогда 
		Возврат;
	КонецЕсли;
	
	СписокЗн = ПолучитьСписокВыбора(Объект.Ссылка);
	ВыбранныйЭлемент = СписокЗн.ВыбратьЭлемент("Печать элемента", "Весь месяц");
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТабличныйДокумент = ПечатьПланПродажПоКонтрагентамСервер(ВыбранныйЭлемент.Значение);
		ТабличныйДокумент.Показать("План продаж по контрагентам");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПерезаписатьДокумент()
	
	Если Вопрос("Для печати необходимо записать документ. Записать документ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Записать();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПечатьПланПродажПоКонтрагентамСервер(ВыбранныйЭлемент)
	
	Зн = РеквизитФормыВЗначение("Объект");
	ТабДок = Зн.Печать("ИА_ПланПродажПоКонтрагентам", ПолучитьСтруктуруНедель(Объект.ИсходныйПлан), ВыбранныйЭлемент); 	
	Возврат ТабДок;
	
КонецФункции  

&НаКлиенте
Процедура ПечатьПланПродажПоПродуктам(Команда)
	
	Если Модифицированность И Не ПерезаписатьДокумент() Тогда 
		Возврат;
	КонецЕсли;
	СписокЗн = ПолучитьСписокВыбора(Объект.Ссылка);
	ВыбранныйЭлемент = СписокЗн.ВыбратьЭлемент("Печать элемента", "Весь месяц");
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТабличныйДокумент = ПечатьПланПродажПоПродуктамСервер(ВыбранныйЭлемент.Значение);
		ТабличныйДокумент.Показать("План продаж по продуктам");
	КонецЕсли;

КонецПроцедуры                           

&НаСервере
Функция ПечатьПланПродажПоПродуктамСервер(ВыбранныйЭлемент)
	
	Зн = РеквизитФормыВЗначение("Объект");
	ТабДок = Зн.Печать("ИА_ПланПродажПоПродуктам", ПолучитьСтруктуруНедель(Объект.ИсходныйПлан), ВыбранныйЭлемент); 	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ПечатьКоррекцияПланаПродажПоКонтрагентам(Команда)
	
	Если Модифицированность И Не ПерезаписатьДокумент() Тогда 
		Возврат;
	КонецЕсли;
	
	СписокЗн = ПолучитьСписокВыбора(Объект.Ссылка);
	ВыбранныйЭлемент = СписокЗн.ВыбратьЭлемент("Печать элемента", "Весь месяц");
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТабличныйДокумент = ПечатьКоррекцияПланаПродажПоКонтрагентамСервер(ВыбранныйЭлемент.Значение);
		ТабличныйДокумент.Показать("Коррекция плана продаж по контрагентам");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьКоррекцияПланаПродажПоПродуктам(Команда)
	
	Если Модифицированность И Не ПерезаписатьДокумент() Тогда 
		Возврат;
	КонецЕсли;
	
	СписокЗн = ПолучитьСписокВыбора(Объект.Ссылка);
	ВыбранныйЭлемент = СписокЗн.ВыбратьЭлемент("Печать элемента", "Весь месяц");
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТабличныйДокумент = ПечатьКоррекцияПланаПродажПоПродуктамСервер(ВыбранныйЭлемент.Значение);
		ТабличныйДокумент.Показать("Коррекция плана продаж по продуктам");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьКоррекцияПланаПродажПоКонтрагентамСервер(ВыбранныйЭлемент)
	
	Зн = РеквизитФормыВЗначение("Объект");
	ТабДок = Зн.Печать("ИА_КоррекцияПланаПродажПоКонтрагентам", ПолучитьСтруктуруНедель(Объект.План), ВыбранныйЭлемент); 	
	Возврат ТабДок;
	
КонецФункции  

&НаСервере
Функция ПечатьКоррекцияПланаПродажПоПродуктамСервер(ВыбранныйЭлемент)
	
	Зн = РеквизитФормыВЗначение("Объект");
	ТабДок = Зн.Печать("ИА_КоррекцияПланаПродажПоПродуктам", ПолучитьСтруктуруНедель(Объект.План), ВыбранныйЭлемент); 	
	Возврат ТабДок;
	
КонецФункции

	
&НаСервереБезКонтекста
Функция ПолучитьСтруктуруНедель(План)
	
	СтруктураНедель = Новый Соответствие;
	
	тз = План.Выгрузить(, "Неделя");
	тз.Свернуть("Неделя");
	тз.Сортировать("Неделя Возр");
	
	НомерНедели = 1;
	Для каждого стр из тз Цикл
		СтруктураНедель.Вставить(стр.Неделя, НомерНедели);
		НомерНедели = НомерНедели + 1;
	КонецЦикла;	
	
	Возврат СтруктураНедель;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбора(Док)
	
	СписокЗначений = Новый СписокЗначений;
	
	тз = Док.ИсходныйПлан.Выгрузить(, "Неделя");
	тз.Свернуть("Неделя");
	тз.Сортировать("Неделя Возр");
	
	СписокЗначений.ЗагрузитьЗначения(тз.ВыгрузитьКолонку("Неделя"));
	СписокЗначений.Добавить("Весь месяц");
	
	Возврат СписокЗначений;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьПоНастройкеНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Сообщить("Не заполнена дата документа, документ необходимо записать.");
		Возврат;
		
	КонецЕсли;	
	
	ДокНастройкаФП = ИА_ФП.ПолучитьПоследнююНастройку(Объект.Организация, Константы.ИА_ФП_ВестиФППоОрганизациям.Получить(), Объект.Дата);
	
	Если ЗначениеЗаполнено(ДокНастройкаФП) Тогда
		
		С = ДокНастройкаФП.ИсточникХранилищеЗапросаКонстурктора.Получить();
		Если Не С = Неопределено Тогда
			тзПараметры = С.Параметры;
			ТекстЗапроса = С.Текст;
			
			Запрос = Новый Запрос;
			Запрос.Текст = С.Текст;
			Для каждого парам Из тзПараметры Цикл
				Запрос.УстановитьПараметр(парам.ИмяПараметра, парам.Значение);
			КонецЦикла; 
						
			Дерево = РеквизитФормыВЗначение("ДеревоПланИсходный");
			Для каждого с1 из Дерево.Строки Цикл
				Дата1 = с1.Неделя;
				Дата2 = КонецДня(с1.КонецНедели);
				Запрос.УстановитьПараметр("ДатаНачала", Дата1);
				Запрос.УстановитьПараметр("ДатаКонца", Дата2);
				тз = Запрос.Выполнить().Выгрузить();
				тз.Свернуть("Контрагент,  Продукт", "Сумма");
				с1.Строки.Очистить();
				Для каждого с2 Из тз Цикл	
					Стр = с1.Строки.Добавить();
					Стр.Неделя = с1.Неделя;
					Стр.НеделяПредставление = ПолучитьПредставлениеНедели(с1.Неделя, с1.КонецНедели);
					ЗаполнитьЗначенияСвойств(стр, с2);					
				КонецЦикла; 
			КонецЦикла;

			ЗначениеВРеквизитФормы(Дерево, "ДеревоПланИсходный");
			
		КонецЕсли;
	КонецЕсли;	
	
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНастройке(Команда)
	ЗаполнитьПоНастройкеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФакт(Команда)
	тд = Элементы.ДеревоПлан.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Если тд.ПолучитьРодителя()<>Неопределено Тогда
		тд = тд.ПолучитьРодителя();
	КонецЕсли;
	
	ЗаполнитьФактНедели(тд.ПолучитьИдентификатор());
	
	ПересчетДокумента();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактНедели(идСтрокиНедели)
	стрНед = ДеревоПлан.НайтиПоИдентификатору(идСтрокиНедели);
	
	ДатаНачала = стрНед.Неделя;
	ДатаКонца = КонецДня(стрНед.КонецНедели);
	
	ДокНастр = ИА_ФП.ПолучитьПоследнююНастройку(Объект.Организация, ФППоОрганизациям, ДатаНачала);
	
	Если не ЗначениеЗаполнено(ДокНастр) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого стрПлан из стрНед.ПолучитьЭлементы() Цикл
		стрПлан.Факт = 0;
	КонецЦикла;
	
	ТЗ_ВидыДоходов = ДокНастр.Доходы.Выгрузить();
	ТЗ_ВидыДоходов.Колонки.добавить("Ссылка");
	ТЗ_ВидыДоходов.ЗаполнитьЗначения(ДокНастр, "Ссылка");
	
	ТЗ_резДоходы = Документы.ИА_ФинансовоеПланирование.ПустаяСсылка().Доходы_Детализация.Выгрузить();
	ТЗ_резДоходы_врем = ТЗ_резДоходы.Скопировать();
	
	// получаем факт
	Для каждого стрДоход из ТЗ_ВидыДоходов Цикл
		ТЗ_резДоходы_врем.Очистить();
		ИА_ФП.ПолучитьСуммуПоВидуДохода(стрДоход, ДатаНачала, ДатаКонца, ТЗ_резДоходы_врем);
		
		Для каждого стрВрем из ТЗ_резДоходы_врем Цикл
			Новстр = ТЗ_резДоходы.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стрВрем);
			Новстр.Сумма = Новстр.Сумма + Новстр.СуммаНал; // для плана все равно
		КонецЦикла;
	КонецЦикла;
	
	ТЗ_резДоходы.Свернуть("Контрагент,Продукт", "Сумма");
	
	сч = ТЗ_резДоходы.Количество() -1;
	
	// заполним факт
	Пока сч>=0 Цикл
		ТекСтр = ТЗ_резДоходы[сч];
		
		СтрокаНайдена = Ложь;
		Для каждого стрПлан из стрНед.ПолучитьЭлементы() Цикл
			Если стрПлан.Контрагент = ТекСтр.Контрагент и стрПлан.Продукт = ТекСтр.Продукт Тогда
				стрПлан.Факт = ТекСтр.Сумма;
				СтрокаНайдена = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаНайдена Тогда
			ТЗ_резДоходы.Удалить(ТекСтр);
		КонецЕсли;
		
		сч = сч - 1;
	КонецЦикла;
	
	// добавим то, что не найдено в плане
	Для каждого стрФакт из ТЗ_резДоходы Цикл
		Новстр = стрНед.ПолучитьЭлементы().Добавить();
		Новстр.Контрагент = стрФакт.Контрагент;
		Новстр.Продукт = стрФакт.Продукт;
		Новстр.Факт = стрФакт.Сумма;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПересчетДокумента()
	ПересчитатьОтклонениеСуммуВСтроках();
	обновитьИтого();
	Модифицированность = Истина;
КонецПроцедуры

Процедура ПересчитатьОтклонениеСуммуВСтроках()
	Для каждого стрНед из ДеревоПлан.ПолучитьЭлементы() Цикл
		ОтклИтого = 0;
		СуммаИтого = 0;
		ФактИтого = 0;
		Для каждого стрПлан из стрНед.ПолучитьЭлементы() Цикл
			стрПлан.отклонение = стрПлан.Факт - стрПлан.Сумма;
			ОтклИтого = ОтклИтого + стрПлан.отклонение;
			СуммаИтого = СуммаИтого + стрПлан.Сумма;
			ФактИтого = ФактИтого + стрПлан.Факт;
		КонецЦикла;
		стрНед.Отклонение = ОтклИтого;
		стрНед.Сумма = СуммаИтого;
		стрНед.Факт = ФактИтого;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМесяцаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.НаМесяц = Дата(ВыбранноеЗначение);
	ПредставлениеМесяца = ПолучитьПредставлениеМесяца(Объект.НаМесяц);
	ЗаполнитьНедели();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеМесяца(пМесяц)
	Если не ЗначениеЗаполнено(пМесяц) Тогда
		Возврат "";
	Иначе
		Возврат ФОРМАТ(пМесяц, "ДФ='ММММ гггг'");
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста // т.к. вызывается с сервера
Функция ПолучитьПредставлениеНедели(пДата, пКонецНедели)
	Возврат ФОРМАТ(пДата, "ДФ=dd.MM")+"-"+ФОРМАТ(пКонецНедели, "ДФ=dd.MM");
КонецФункции


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьВозможныеМесяцы();
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьПлан(Команда)
	Если Вопрос("Вы уверены? Дальнейшее редактирование исходного плана будет запрещено.", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да Тогда
		Возврат
	КонецЕсли;
	
	Для каждого стрНед из ДеревоПланИсходный.ПолучитьЭлементы() Цикл
		НовстрНед = ДеревоПлан.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НовстрНед, стрНед);
		
		Для каждого стрСумма из стрНед.ПолучитьЭлементы() Цикл
			НовстрСумма = НовстрНед.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовстрСумма, стрСумма);
		КонецЦикла;
	КонецЦикла;
	
	Модифицированность = истина;
	Объект.ПланУтвержден = истина;
	обновитьИтого();
	ОбновитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;
	Если Элемент.ТекущиеДанные.ЭтоНеделя Тогда
		Выполнение = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
	МассивВыбора = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(МассивВыбора) = Тип("Массив") Тогда
		Выбор = МассивВыбора[0];
	Иначе
		Выбор = МассивВыбора;
	КонецЕсли;
	
	ИсхСтрока = ДеревоПлан.НайтиПоИдентификатору(Выбор);
	РезСтрока = ДеревоПлан.НайтиПоИдентификатору(Строка);

	Если РезСтрока.ПолучитьРодителя() = Неопределено тогда // неделя
		Новстр = РезСтрока.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, ИсхСтрока);
		Новстр.неделя = РезСтрока.неделя;
		Новстр.КонецНедели = РезСтрока.КонецНедели;
		
		тс = РезСтрока.ПолучитьИдентификатор();
		Если не Элемент.Развернут(тс) Тогда
			Элемент.Развернуть(тс);
		КонецЕсли;
	Иначе // строка плана
		Новстр = РезСтрока.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, ИсхСтрока);
		Новстр.неделя = РезСтрока.ПолучитьРодителя().неделя;
		Новстр.КонецНедели = РезСтрока.ПолучитьРодителя().КонецНедели;
	КонецЕсли;
	Элемент.ТекущаяСтрока = новстр.ПолучитьИдентификатор();
	
	ИсхСтрока.ПолучитьРодителя().ПолучитьЭлементы().Удалить(ИсхСтрока);
	
	ПересчетДокумента();
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПланФактПриИзменении(Элемент)
	ПересчетДокумента();
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	//
	Объект.Организация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.Организация);
	//
КонецПроцедуры
